Repository: EHOT-HA-KOHE/WAY_OUT_PROJECT
Catalog: locales/texts/*.po
Languages: ru, uk

# test_message
source: Hello, world!
ru: Привет, мир!
uk: Привіт світ!

# hi
source: Hello!
ru: Привет!
uk: Привіт!

# hi_with_name {name}
source: Hello, {name}!
ru: Привет, {name}!
uk: Привіт, {name}!

# hi_with_name_and_age {name} {age}
source: Hello, my name is {name} and I`m {age} years old!
ru: Здравствуйте, меня зовут {name} и мне {age} лет!
uk: Привіт, мене звати {name} і мені {age} років!

# fuck
source: Go FUCK!
ru: Иди НАХУЙ!
uk: Іди НАХУЙ!

# select_language
source: Сhoose language!
ru: Выберите язык
uk: Виберіть мову

# language_was_changed
source: Your account language has been changed to EN
ru: Язык вашей учетной записи был изменен на RU
uk: Мову вашого облікового запису змінено на UK

# start_message
source: Hello, we are glad to welcome you again in our application! 😊👍
ru: Здравствуйте, рады снова вас приветствовать в нашем приложении! 😊👍
uk: Здрастуйте, раді знову вас вітати в нашому додатку! 😊👍

# start_register_message
source: To have full functionality, you need to register, are you ready to do it now?
ru: Чтобы иметь полный функционал, вам нужно зарегистрироваться, вы готовы сделать это сейчас?
uk: Щоб мати повний функціонал, вам потрібно зареєструватися, чи ви готові зробити це зараз?

# edit_user_ask_name
source: **Choose a name:** __Enter a name or choose a suggestion__
ru: **Выберите имя:** __Введите имя или выберите предложенное__
uk: **Виберіть ім'я:** __Введіть ім'я або виберіть запропоноване__

# edit_user_ask_sex
source: **Select sex:**
ru: **Выберите пол:**
uk: **Виберіть стать:**

# edit_user_ask_age
source: **Enter your age:**👇
ru: **Введите ваш возраст:**👇
uk: **Введіть ваш вік:**👇

# edit_user_ask_city
source: **Select your city:** __Enter a city or select suggested__👇
ru: **Выберите ваш город:** __Введите город или выберите предложенный__👇
uk: **Виберіть ваше місто:** __Введіть місто або виберіть запропонований__👇

# edit_user_ask_info
source: **Tell us about yourself**👇
ru: **Расскажите о себе**👇
uk: **Розкажіть про себе**👇

# edit_user_ask_photo
source: **Submit a photo for your profile**
ru: **Отправьте фото для своего профиля**
uk: **Надішліть фото для свого профілю**

# edit_user_finish_register
source: **Registration is over, your profile will look like this, apply the changes?**
ru: **Регистрация окончена, ваш профиль будет выглядеть вот так, применить изменения?**
uk: **Реєстрація закінчена, ваш профіль виглядатиме ось так, застосувати зміни?**

# dont_understand_you
source: I don't understand what you want from me
ru: Я не понимаю чего вы от меня хотите
uk: Я не розумію чого ви від мене хочете

# still_dont_understand_you
source: I still don't understand what you want from me
ru: Я все еще не понимаю, что вы хотите от меня
uk: Я все ще не розумію, що ви хочете від мене

# edit_user_successful_register
source: Registration was completed successfully
ru: Регистрация была окончена успешно
uk: Реєстрація була закінчена успішно

# main_menu_my_events_button
source: My events
ru: Мои акции
uk: Мої заходи

# main_menu_way_out_events_button
source: WAY_OUT events
ru: WAY_OUT акции
uk: WAY_OUT заходи

# main_menu_users_events_button
source: Users events
ru: Пользовательские акции
uk: Користувальницькі заходи

# main_menu_user_profile_button
source: Profile ⚙️
ru: Профиль ⚙️
uk: Профіль ⚙️

# user_info
source: **Now your account looks like this:**
ru: **Сейчас ваш аккаунт выглядит вот так:**
uk: **Зараз ваш обліковий запис виглядає ось так:**

source: Edit profile
ru: Редактировать профиль
uk: Редагувати профіль

source: Change language
ru: Изменить язык
uk: Змінити мову

source: Main menu
ru: Главное меню
uk: Головне меню

# error_edit_user_ask_age
source: Age must be numeric only
ru: Возраст должен состоять только из цифр
uk: Вік повинен складатися лише з цифр

source: Cancel
ru: Отмена
uk: Скасувати

source: Approve changes
ru: Применить изменения
uk: Затвердити зміни

source: Do this later
ru: Сделать это позже
uk: Зробіть це пізніше

source: Yes
ru: Да
uk: Так

source: No
ru: Нет
uk: Ні

source: Publish
ru: Опубликовать
uk: Опублікувати

# edit_event_approve_changes_text
source: Your event looks like this: publish it or cancel the creation of the event 👆👆👆
ru: Ваше мероприятие выглядит вот так: опубликуйте его или отмените создание мероприятия 👆👆👆
uk: Ваш захід має такий вигляд: опублікуйте його або скасуйте створення заходу 👆👆👆

# edit_event_ask_title
source: **Enter title for your event**👇
ru: **Введите название для вашего мероприятия**👇
uk: **Введіть назву події**👇

# edit_event_ask_category_name
source: **Enter category name for your event**👇
ru: **Введите название категории для вашего мероприятия**👇
uk: **Введіть назву категорії для вашої події**👇

# edit_event_ask_description
source: **Enter description for your event**👇
ru: **Введите описание вашего мероприятия**👇
uk: **Введіть опис події**👇

# edit_event_ask_city
source: **Enter city for your event**👇
ru: **Введите город для вашего мероприятия**👇
uk: **CВведіть місто для вашої події**👇

# edit_event_ask_max_amount_of_people
source: **Enter the maximum number of people that can participate in the event**👇
ru: **Введите максимальное количество людей, которое сможет принять участие в мероприятии**👇
uk: **Введіть максимальну кількість людей, яка зможе взяти участь у заході**👇

# edit_event_ask_date
source: **Enter date for your event**👇
ru: **Введите дату вашего мероприятия**👇
uk: **Введіть дату вашої події**👇

# edit_event_ask_location
source: **Send location for your event**👇
ru: **Отправить место для вашего мероприятия**👇
uk: **Надішліть місце для вашої події**👇

# edit_event_ask_photo
source: **Send photo for your event**👇
ru: **Отправить фото для вашего мероприятия**👇
uk: **Надішліть фото для вашої події**👇

source: Create new
ru: Создать новое
uk: Створити новий

source: I joined
ru: Я присоединился
uk: Я приєднався

source: I created
ru: Я создал
uk: Я створив

# main_menu_my_events_text
source: **Choose an action from the suggested:**
ru: **Выберите действие из предложенных:**
uk: **Виберіть дію із запропонованих:

# error_edit_event_ask_description
source: **Text is too long, please send text up to 700 characters:**👇
ru: **Текст слишком длинный, отправьте текст длинной до 700 символов:**👇
uk: **Текст надто довгий, надішліть текст довжиною до 700 символів:**👇

# successfully_completed_event_creation
source: **Your event has been successfully published**👍👍👍
ru: **Ваше мероприятие было успешно опубликовано**👍👍👍
uk: **Ваш захід був успішно опублікований**👍👍👍

# main_menu_users_events_categories_button
source: Categories
ru: Категории
uk: Категорії

# main_menu_users_events_dates_button
source: By dates
ru: По датам
uk: За датами

# main_menu_users_events_random_event_button
source: Random
ru: Случайное
uk: Випадкове

# main_menu_users_events_text
source: How to sort events?
ru: Как сортировать мероприятия?
uk: Як сортувати події?

# join_button
source: Join
ru: Присоединиться
uk: Приєднатися

# another_button
source: Other
ru: Другое
uk: Інше

# delete_button
source: Delete
ru: Удалить
uk: Видалити

# back_button
source: Back
ru: Назад
uk: Назад

source: Event has been successfully deleted
ru: Мероприятие успешно удалено
uk: Подію успішно видалено

# leave_button
source: Leave
ru: Покинуть
uk: Залишити

source: List of events the user joined 👆👆👆
ru: Список мероприятий, к которым присоединился пользователь 👆👆👆
uk: Список заходів, до яких приєднався користувач 👆👆👆

# list_of_events_the_user_joined_one_event
source: User-joined event (single) 👆👆👆
ru: Мероприятие, к которому присоединился пользователь (единственное) 👆👆👆
uk: Захід, до якого приєднався користувач (єдиний) 👆👆👆

# user_successfully_del_from_the_event
source: You left the event 🙀🤯 You can always return or join another event 😉😃
ru: Вы покинули мероприятие 🙀🤯🤯🤯🤯 Вы всегда можете вернуться или присоединиться к другому мероприятию 😉😃
uk: Ви залишили захід 🙀🤯 Ви завжди можете повернутися або приєднатися до іншого заходу 😉😃

# user_successfully_added_to_the_event
source: You joined the event 😃👍 We hope you enjoy your time 😉😃
ru: Вы присоединились к мероприятию 😃👍 Надеемся что вы с удовольствием проведете время 😉😃
uk: Ви приєдналися до заходу 😃👍 Сподіваємося, що ви із задоволенням проведете час 😉😃

# choose_category_of_users_events_for_filter
source: Choose a category 👇👇👇
ru: Выберите категорию 👇👇👇
uk: Виберіть категорію 👇👇👇

# list_of_events_the_user_created_one_event
source: User-created event (single) 👆👆👆
ru: Мероприятие, созданное пользователем (единственное) 👆👆👆
uk: Захід, створений користувачем (єдиний) 👆👆👆

source: List of events the user created 👆👆👆
ru: Список мероприятий, созданных пользователем 👆👆👆
uk: Список заходів, створених користувачем 👆👆👆

# list_of_events_filter_category
source: All events in the category:
ru: Все мероприятия в категории:
uk: Усі заходи у категорії:

# list_of_events_filter_category_one_event
source: The only event in the category:
ru: Единственное мероприятие в категории:
uk: Єдиний захід у категорії:

# list_of_random_events
source: This is a random event, you can join it or click 'Other' to continue watching events in random order Total events:
ru: Это случайное мероприятие, вы можете присоединиться к нему или нажать 'Другое', чтобы продолжить смотреть мероприятия в случайном порядке Всего мероприятий:
uk: Це випадковий захід, ви можете приєднатися до нього або натиснути 'Інше', щоб продовжити дивитися заходи у випадковому порядку Усього заходів:

# list_of_random_events_one_event
source: Now only one event has been created Total events:
ru: Сейчас созданно всего одно мероприятие Всего мероприятий:
uk: Зараз створено лише один захід Усього заходів:
